{
    "mtf2json": "0.2.4",
    "chassis": "Cicada",
    "model": "CDA-3MA",
    "mul_id": 597,
    "config": "Biped",
    "techbase": "Inner Sphere",
    "era": 3068,
    "source": "TRO: 3050",
    "rules_level": 2,
    "rules_level_str": "Standard",
    "role": "Striker",
    "quirks": [
        "no_arms"
    ],
    "mass": 40,
    "engine": "320 XL Engine",
    "structure": {
        "type": "Standard",
        "head": {
            "pips": 3
        },
        "center_torso": {
            "pips": 12
        },
        "left_torso": {
            "pips": 10
        },
        "right_torso": {
            "pips": 10
        },
        "left_arm": {
            "pips": 6
        },
        "right_arm": {
            "pips": 6
        },
        "left_leg": {
            "pips": 10
        },
        "right_leg": {
            "pips": 10
        }
    },
    "myomer": "Standard",
    "heat_sinks": {
        "quantity": 10,
        "type": "Double"
    },
    "walk_mp": 8,
    "run_mp": 12,
    "jump_mp": 0,
    "armor": {
        "type": "Standard",
        "left_arm": {
            "pips": 12
        },
        "right_arm": {
            "pips": 12
        },
        "left_torso": {
            "front": {
                "pips": 15
            },
            "rear": {
                "pips": 5
            }
        },
        "right_torso": {
            "front": {
                "pips": 15
            },
            "rear": {
                "pips": 5
            }
        },
        "center_torso": {
            "front": {
                "pips": 17
            },
            "rear": {
                "pips": 6
            }
        },
        "head": {
            "pips": 9
        },
        "left_leg": {
            "pips": 20
        },
        "right_leg": {
            "pips": 20
        }
    },
    "weapons": [
        {
            "weapon": "ISMediumLaser",
            "location": "right_torso",
            "facing": "front",
            "quantity": 1
        },
        {
            "weapon": "ISSNPPC",
            "location": "left_torso",
            "facing": "front",
            "quantity": 1
        },
        {
            "weapon": "ISMediumLaser",
            "location": "left_torso",
            "facing": "front",
            "quantity": 1
        },
        {
            "weapon": "ISSmallPulseLaser",
            "location": "center_torso",
            "facing": "front",
            "quantity": 1
        }
    ],
    "critical_slots": {
        "left_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": null,
            "4": null,
            "5": null,
            "6": null,
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "right_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": null,
            "4": null,
            "5": null,
            "6": null,
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "left_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "Fusion Engine",
            "4": "ISSNPPC",
            "5": "ISSNPPC",
            "6": "ISMediumLaser",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "right_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "Fusion Engine",
            "4": "ISMediumLaser",
            "5": null,
            "6": null,
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "center_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "Fusion Engine",
            "4": "Gyro",
            "5": "Gyro",
            "6": "Gyro",
            "7": "Gyro",
            "8": "Fusion Engine",
            "9": "Fusion Engine",
            "10": "Fusion Engine",
            "11": "ISSmallPulseLaser",
            "12": null
        },
        "head": {
            "1": "Life Support",
            "2": "Sensors",
            "3": "Cockpit",
            "4": null,
            "5": "Sensors",
            "6": "Life Support",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "left_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": null,
            "6": null,
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "right_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": null,
            "6": null,
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        }
    },
    "fluff": {
        "overview": "Designed as a supplement or replacement for the popular Locust scout ’Mech, the Cicada found limited use by the Star League after its introduction in 2740.",
        "capabilities": "The Cicada's main advantages are its speed and a lack of ammunition. A gigantic Pitban 320 engine, which accounts for more than half of the Cicada's entire mass, propels the 40-ton BattleMech to almost 130 kph. A trio of lasers, two medium and one small, provide the Cicada with ample firepower to take on its chosen targets: lighter 'Mechs. The lasers are implanted in the Cicada's armored midsection, beneath the toughest shielding the 'Mech mounts, however their shooting arcs are limited. A foe who is successful in getting behind the Cicada has little to fear. The rest of the 'Mech, however, is just minimally armored. Its limbs are vestigial—really, wings—and can only carry little armor. The Cicada's legs, while robust enough to carry the 'Mech at breakneck speeds, are also unarmored.",
        "deployment": "A training 'Mech introduced in 3068, this variation of the -3M swaps the UAC/5 for a snub-nose PPC and additional armor. Its primary purpose is to help introduce new technology to cadets.",
        "history": "The Cicada was introduced amidst rising tensions in 2740 by HartfordCo Industries in an attempt to capitalize on the growing need for BattleMechs. At the time Bergan Industries had cornered the market in light recon 'Mechs with their Locust and HartfordCo's only prior experience was building communications and targeting systems. Nevertheless the company designed their 'Mech to compete directly with the Locust by making it just as fast but twice as large, allowing the Cicada to carry slightly better weaponry and give it an edge in physical combat, all while keeping costs down. The Star League was sufficiently impressed that they agreed to a limited contract with HartfordCo for a small number of Cicadas, using them to replace many Locusts lost in fighting along its border regions. The 'Mech's only major issue was faulty heat sinks, although these were eventually replaced in many models with modular sinks. With their base of operations and only Cicada factory located on Bryant, HartfordCo was among the many victims of the fall of the Star League and the onset of the Succession Wars. Although the factory was destroyed, there were a number of built Cicadas in storage on Bryant and its relative position compared to the five Successor States meant the planet was the target of many raids. Thus the Cicada found its way into all of the major House armies, where in service to the Successor Lords, the 'Mech earned a positive reputation. Unfortunately this also meant its expectations sometimes exceeded the design's actual capabilities, and, with no new models being produced, the Cicada's numbers began to dwindle. By the end of the Fourth Succession War the 'Mech was in danger of going extinct. The discovery of the Helm Memory Core allowed Free Worlds Defense Industries to save the Cicada by restarting production of the 'Mech from their newly-refurbished production line on Gibson. The great majority of these newly-built Cicadas went to the Free Worlds League Military, particularly federal units, which were in desperate need for recon 'Mechs after the loss of so many machines during their long battle with Andurien. The chassis was also the perfect platform to apply much of the now-recovered lostech and the improved CDA-3M was introduced shortly before the start of the Clan Invasion. New Cicadas were supplied to the Federated Commonwealth and Draconis Combine as part of an agreement to combat the Clans, and as reports filtered in from the front more variants of the 'Mech were produced. Following the ComStar Schism the Word of Blake relocated to Gibson and an increasing amount of Cicada production was redirected to the Word of Blake Militia, which quickly rivaled the FWLM as the largest Cicada user. As such the 'Mech was found on both sides of the Jihad.",
        "manufacturer": [
            "Gibson Federated BattleMechs (A Division of Free Worlds Defense Industries)"
        ],
        "primaryfactory": [
            "Gibson"
        ],
        "systemmanufacturer": {
            "chassis": "Kell Reinforced 240",
            "engine": "Pitban 320 XL",
            "armor": "StarSlab/3",
            "communications": "Datacom 50",
            "targeting": "Dynatec 1122"
        }
    }
}