{
    "mtf2json": "0.2.7",
    "chassis": "Flea",
    "model": "FLE-21",
    "mul_id": 9313,
    "config": "Biped",
    "tech_base": "IS",
    "era": 3139,
    "source": "Rec Guide:ilClan #26",
    "rules_level": 2,
    "rules_level_str": "Standard",
    "role": "Scout",
    "quirks": [
        "easy_maintain",
        "imp_life_support",
        "no_arms"
    ],
    "mass": 20,
    "engine": {
        "name": "180 Light Engine",
        "type": "Light",
        "tech_base": "IS"
    },
    "structure": {
        "type": "Endo Steel",
        "tech_base": "IS",
        "head": {
            "pips": 3
        },
        "center_torso": {
            "pips": 6
        },
        "left_torso": {
            "pips": 5
        },
        "right_torso": {
            "pips": 5
        },
        "left_arm": {
            "pips": 3
        },
        "right_arm": {
            "pips": 3
        },
        "left_leg": {
            "pips": 4
        },
        "right_leg": {
            "pips": 4
        }
    },
    "myomer": "Standard",
    "heat_sinks": {
        "quantity": 10,
        "type": "IS Double"
    },
    "walk_mp": 9,
    "run_mp": 14,
    "jump_mp": 0,
    "armor": {
        "type": "Stealth",
        "tech_base": "IS",
        "left_arm": {
            "pips": 4
        },
        "right_arm": {
            "pips": 4
        },
        "left_torso": {
            "front": {
                "pips": 5
            },
            "rear": {
                "pips": 3
            }
        },
        "right_torso": {
            "front": {
                "pips": 5
            },
            "rear": {
                "pips": 3
            }
        },
        "center_torso": {
            "front": {
                "pips": 8
            },
            "rear": {
                "pips": 3
            }
        },
        "head": {
            "pips": 5
        },
        "left_leg": {
            "pips": 4
        },
        "right_leg": {
            "pips": 4
        }
    },
    "weapons": [
        {
            "name": "ER Medium Laser",
            "location": "left_arm",
            "facing": "front",
            "quantity": 1
        },
        {
            "name": "ER Medium Laser",
            "location": "right_arm",
            "facing": "front",
            "quantity": 1
        },
        {
            "name": "ER Flamer",
            "location": "center_torso",
            "facing": "front",
            "quantity": 1
        }
    ],
    "critical_slots": {
        "left_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "ISERMediumLaser",
            "4": "IS Endo Steel",
            "5": "IS Endo Steel",
            "6": "IS Endo Steel",
            "7": "IS Endo Steel",
            "8": "IS Stealth",
            "9": "IS Stealth",
            "10": null,
            "11": null,
            "12": null
        },
        "right_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "ISERMediumLaser",
            "4": "IS Endo Steel",
            "5": "IS Endo Steel",
            "6": "IS Endo Steel",
            "7": "IS Endo Steel",
            "8": "IS Stealth",
            "9": "IS Stealth",
            "10": null,
            "11": null,
            "12": null
        },
        "left_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "ISDoubleHeatSink",
            "4": "ISDoubleHeatSink",
            "5": "ISDoubleHeatSink",
            "6": "ISDoubleHeatSink",
            "7": "ISDoubleHeatSink",
            "8": "ISDoubleHeatSink",
            "9": "IS Endo Steel",
            "10": "IS Endo Steel",
            "11": "IS Stealth",
            "12": "IS Stealth"
        },
        "right_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "ISDoubleHeatSink",
            "4": "ISDoubleHeatSink",
            "5": "ISDoubleHeatSink",
            "6": "ISGuardianECMSuite",
            "7": "ISGuardianECMSuite",
            "8": "IS Endo Steel",
            "9": "IS Endo Steel",
            "10": "IS Endo Steel",
            "11": "IS Stealth",
            "12": "IS Stealth"
        },
        "center_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "Fusion Engine",
            "4": "Gyro",
            "5": "Gyro",
            "6": "Gyro",
            "7": "Gyro",
            "8": "Fusion Engine",
            "9": "Fusion Engine",
            "10": "Fusion Engine",
            "11": "ER Flamer",
            "12": "Supercharger"
        },
        "head": {
            "1": "Life Support",
            "2": "Sensors",
            "3": "Cockpit",
            "4": "IS Endo Steel",
            "5": "Sensors",
            "6": "Life Support",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "left_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "IS Stealth",
            "6": "IS Stealth",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "right_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "IS Stealth",
            "6": "IS Stealth",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        }
    },
    "fluff": {
        "overview": "Focused on speed and firepower, the lightly armored Flea was an extremely rare sight until the arrival of the Wolf's Dragoons mercenary unit, with the design experiencing a revival as an inexpensive recon and anti-personnel militia 'Mech.",
        "capabilities": "The Flea's inability to jump makes it difficult to navigate difficult terrain. Its incredible speed, on the other hand, ensures that few 'Mechs of any era can keep up with it in the open. While this Flea has more weaponry than its ultra-light predecessor, its armour is still incapable of withstanding direct combat. The Flea should only engage in hit and run attacks, with experienced MechWarriors focusing on the run aspect. Another specialty of the Flea, especially in large numbers, is incendiary operations behind enemy lines.",
        "deployment": "No information available on current variant",
        "history": "Initially called the Trooper when it was introduced as the Free Worlds League's first light scout BattleMech in 2475, the design was so heavily flawed that it took 25 years before all the issues were corrected, with a new name selected to escape the bad press. The early prototype was designed by Colonel J. Marcus Llewelyn-Jaymes and his handpicked team at Toddlette Industries in a bid to create a dedicated reconnaissance BattleMech for the Free Worlds League Military. The design was considered highly maneuverable and lightweight at the time, and utilized a basic chassis similar to their larger WorkMechs; the 'Mech's systems appeared straightforward, with a power plant, gyroscope, cockpit, and other critical systems housed in an \"armored-box\" mounted on reinforced, armored \"bird-walker\" legs. Only with the help of Col. Llewelyn-Jaymes contacts in the military and government circles, and according to rumors, possible bribery of politicians and decision makers, the FWLM ultimately accepted delivery of the Trooper. While it was considered easy to maintain by technicians and logisticians, it wasn't long before it gained a poor reputation among those that piloted it. Since the design was based off their WorkMechs, it completely lacked any dedicated ejection mechanism, and forced pilots to manually exit should they become disabled. Additionally, the legs proved to be unable to cope with heavy combat, which became apparent in various failed trials before the FWLM's Minister of Defense. Despite these shortcomings, the League's Chief Armorer and Quartermaster General continued purchasing the prototype year after year. This ultimately led to the Trooper being selected as the very first FWLM 'Mech to be upgraded with \"modern\" technology in 2501 and rechristened as the FLE-4 Flea. While produced on and off until the early Succession Wars, excessive losses of the lightly armored design led Earthwerks to switch its production line to manufacturing heavier designs. This changed with the arrival of Wolf's Dragoons, who brought with them a large number of Fleas and reached an exclusive production arrangement with Earthwerks that resulted in the company opening new lines to replenish the Dragoons' losses in the Fourth Succession War. With multiple lines on Asuncion, Bernardo and Victoria, after letting the Dragoons' exclusivity clause lapse, Earthwerks started selling the easy to manufacture, easy to maintain 'Mech by the DropShip load across the Inner Sphere. Originally produced exclusively for the Dragoons until the Capellan Confederation acquired the design's blueprints via a Maskirovka raid during the 3040s, the post–Helm Memory Core FLE-17 variant is based on the older FLE-15 model. Since the Dragoons used the Flea in a recon role more than an antipersonnel 'Mech, Earthwerks conceived a new design by incorporating recovered technology. Retaining the design's maximum speed of 97.2 km/h, the addition of an endo steel chassis frees up weight for a MASC system that allows the 'Mech's speed to be pushed up to 129.6 km/h in short bursts. The increase of speed is required to ensure survival on the modern battlefield, as the FLE-17 is only clad in a pitiful three tons of Livingston Ceramics armor plating. Once the FLE-17 plans were captured and the Dragoons' contract clause lapsed, Earthwerks began producing the new design almost exclusively for the Confederation until 3053, which saw use within their numerous militias. It was rarely seen among any of the other Great Houses' military, but some sightings did appear after on the mercenary markets with Dragoon serial numbers, which gave some credibility to reports of Wannamaker's Widowmakers operating an extensive salvage operation on Outreach. With the Confederation's later advances in stealth technology and light weaponry, the Flea became a logical test platform for new prototypes. These performed well, which encouraged Earthwerks to refit several older models.",
        "manufacturer": [
            "Earthwerks-FWL",
            "Inc.",
            "Earthwerks-FWL",
            "Inc.",
            "Earthwerks Ltd."
        ],
        "primaryfactory": [
            "Asuncion",
            "Bernardo",
            "Grand Base"
        ],
        "systemmanufacturer": {
            "chassis": "Earthwerk Trooper M",
            "engine": "Unknown Light Fusion",
            "armor": "Livingston Ceramics",
            "communications": "Neil 2000",
            "targeting": "Dalban HiRez-B"
        }
    }
}