{
    "mtf2json": "0.2.6",
    "chassis": "Grasshopper",
    "model": "GHR-6K",
    "mul_id": 1269,
    "config": "Biped",
    "techbase": "Inner Sphere",
    "era": 3064,
    "source": "TRO: 3050",
    "rules_level": 2,
    "rules_level_str": "Standard",
    "role": "Skirmisher",
    "quirks": [
        "rugged_1"
    ],
    "mass": 70,
    "engine": "280 Fusion Engine",
    "structure": {
        "type": "Endo-Steel",
        "head": {
            "pips": 3
        },
        "center_torso": {
            "pips": 22
        },
        "left_torso": {
            "pips": 15
        },
        "right_torso": {
            "pips": 15
        },
        "left_arm": {
            "pips": 11
        },
        "right_arm": {
            "pips": 11
        },
        "left_leg": {
            "pips": 15
        },
        "right_leg": {
            "pips": 15
        }
    },
    "myomer": "Standard",
    "heat_sinks": {
        "quantity": 17,
        "type": "Double"
    },
    "walk_mp": 4,
    "run_mp": 6,
    "jump_mp": 4,
    "armor": {
        "type": "Standard",
        "left_arm": {
            "pips": 22
        },
        "right_arm": {
            "pips": 22
        },
        "left_torso": {
            "front": {
                "pips": 20
            },
            "rear": {
                "pips": 10
            }
        },
        "right_torso": {
            "front": {
                "pips": 20
            },
            "rear": {
                "pips": 10
            }
        },
        "center_torso": {
            "front": {
                "pips": 30
            },
            "rear": {
                "pips": 13
            }
        },
        "head": {
            "pips": 9
        },
        "left_leg": {
            "pips": 26
        },
        "right_leg": {
            "pips": 26
        }
    },
    "weapons": [
        {
            "name": "ISERLargeLaser",
            "location": "center_torso",
            "facing": "front",
            "quantity": 1
        },
        {
            "name": "ISMediumPulseLaser",
            "location": "right_arm",
            "facing": "front",
            "quantity": 1
        },
        {
            "name": "ISMediumPulseLaser",
            "location": "right_torso",
            "facing": "front",
            "quantity": 1
        },
        {
            "name": "ISMediumPulseLaser",
            "location": "left_torso",
            "facing": "front",
            "quantity": 2
        },
        {
            "name": "ISMediumPulseLaser",
            "location": "left_arm",
            "facing": "front",
            "quantity": 1
        },
        {
            "name": "ISC3SlaveUnit",
            "location": "left_torso",
            "facing": "front",
            "quantity": 1
        },
        {
            "name": "ISStreakSRM4",
            "location": "head",
            "facing": "front",
            "quantity": 1,
            "ammo": 25
        }
    ],
    "critical_slots": {
        "left_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "Lower Arm Actuator",
            "4": "Hand Actuator",
            "5": "ISDouble Heat Sink",
            "6": "ISDouble Heat Sink",
            "7": "ISDouble Heat Sink",
            "8": "ISMediumPulseLaser",
            "9": "Endo-Steel",
            "10": "Endo-Steel",
            "11": "Endo-Steel",
            "12": "Endo-Steel"
        },
        "right_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "Lower Arm Actuator",
            "4": "Hand Actuator",
            "5": "ISDouble Heat Sink",
            "6": "ISDouble Heat Sink",
            "7": "ISDouble Heat Sink",
            "8": "ISMediumPulseLaser",
            "9": "Endo-Steel",
            "10": "Endo-Steel",
            "11": "Endo-Steel",
            "12": "Endo-Steel"
        },
        "left_torso": {
            "1": "ISDouble Heat Sink",
            "2": "ISDouble Heat Sink",
            "3": "ISDouble Heat Sink",
            "4": "ISDouble Heat Sink",
            "5": "ISDouble Heat Sink",
            "6": "ISDouble Heat Sink",
            "7": "ISMediumPulseLaser",
            "8": "ISMediumPulseLaser",
            "9": "ISC3SlaveUnit",
            "10": "Endo-Steel",
            "11": "Endo-Steel",
            "12": "Endo-Steel"
        },
        "right_torso": {
            "1": "ISDouble Heat Sink",
            "2": "ISDouble Heat Sink",
            "3": "ISDouble Heat Sink",
            "4": "ISDouble Heat Sink",
            "5": "ISDouble Heat Sink",
            "6": "ISDouble Heat Sink",
            "7": "ISMediumPulseLaser",
            "8": "ISStreakSRM4 Ammo",
            "9": "ISCASE",
            "10": "Endo-Steel",
            "11": "Endo-Steel",
            "12": "Endo-Steel"
        },
        "center_torso": {
            "1": "Engine",
            "2": "Engine",
            "3": "Engine",
            "4": "Gyro",
            "5": "Gyro",
            "6": "Gyro",
            "7": "Gyro",
            "8": "Engine",
            "9": "Engine",
            "10": "Engine",
            "11": "ISERLargeLaser",
            "12": "ISERLargeLaser"
        },
        "head": {
            "1": "Life Support",
            "2": "Sensors",
            "3": "Cockpit",
            "4": "ISStreakSRM4",
            "5": "Sensors",
            "6": "Life Support"
        },
        "left_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "Jump Jet",
            "6": "Jump Jet"
        },
        "right_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "Jump Jet",
            "6": "Jump Jet"
        }
    },
    "fluff": {
        "overview": "Originally intended as a stealthy hunter-killer of light and medium 'Mechs for the SLDF, the Grasshopper entered service in 2780 after hostilities had already ceased in the Amaris Civil War.",
        "capabilities": "With great mobility and a predominately shorter-ranged, energy-based weaponry, the Grasshopper proved itself during the First Succession War. The 'Mech's ground speed of 64.8 km/h was augmented by four Leviathan Lifter jump jets, one pair in each leg, giving it a jumping capability of one hundred and twenty meters. Revolutionary for its time, the appearance of a heavy 'Mech with the mobility of a lighter design caused a change in tactics; the Grasshopper became known for using surprise and speed to appear suddenly in the midst of a tightly-packed Lance, a devastating situation should the enemy lack short-ranged weapons themselves. The use of twenty-two heat sinks also gave it superior heat dissipation rates compared to other heavy 'Mechs, while its low dependence on ammunition allowed the Grasshopper to operate away from established supply lines for extended periods of time. Though it could be outgunned by other 'Mechs of similar tonnage, the combination of its mobility and thirteen tons of standard armor allowed the Grasshopper to at least inflict significant damage before being forced to withdraw. Finally, mounting its primary weapon in its center torso meant the Grasshopper remained combat-capable despite suffering crippling damage, including losing both arms, leading many to classify it as a \"zombie\" 'Mech.",
        "deployment": "The 6K variant of the Grasshopper was introduced by LexaTech Industries of Hun Ho in 3064. Upgrading the design by using an Endo Steel chassis and seventeen double heat sinks, it is armed with an ER large laser and five Medium Pulse Lasers. The LRM-5 launcher has also been replaced with a Guided Technologies 2nd Generation Streak SRM-4 missile launcher fed by a ton of ammunition protected by CASE, while a C3 slave unit allows it to share targeting data with friendly units.",
        "history": "Problems integrating the original stealth systems with the chassis meant the Grasshopper missed the climactic end to the conflict. The stealth systems were ultimately removed from the final design. The untested and unorthodox 'Mech was distributed primarily to the regular army rather than the more prestigious Royal units, and within four years it could be found in most Star League regiments. Thus as the League dissolved, with the chaos of Operation EXODUS and the defection of many SLDF units to the Successor States, Grasshoppers found their way into the various House armies one way or another. Besides hunting down lighter machines to clear the way for heavier, less-mobile 'Mechs, the Grasshopper's mobility and endurance meant it often spearheaded assaults to storm fortifications, led flanking attacks to hit the enemy from the rear, and served as back-up brawler for companies of light and medium 'Mechs. Its ability to operate independently made it an excellent choice as a raider and guerrilla fighter, an attribute also prized by mercenary units in need of self-reliant 'Mechs. While popular the Grasshopper was also an uncommon sight during the Succession Wars, causing many commanders to mistakenly treat it as just another heavy 'Mech. By the time they realized their mistake it was too late, though following ComStar's publication of Technical Readout: 3025 military leaders became more familiar with the 'Mech. In the midst of the Second Succession War the Lantren Corporation's factory on Bryant was destroyed in 2843, a result of worsening global storms and damage inflicted during the conflict, causing production of the 'Mech to cease. However, the Grasshopper was usually prioritized over other 'Mechs, even a unit commander's own, when it came time to repair and rebuild after a battle. Thus most of the original production run was still in active duty even after centuries of use. Lantren Corporation would eventually introduce a new variant in 3049, the GHR-5J, which upgraded many of its original systems with superior lostech components. Yet the original model was so popular that it would still outnumber the -5J for decades to come by a ratio of three to one. Only when the Draconis Combine introduced their own C3 variant that trend began to reverse. Further variants were introduced in the years following, and the Grasshopper participated in many conflicts, including both sides of the Jihad.",
        "manufacturer": [
            "LexaTech Industries",
            "Jalastar Aerospace"
        ],
        "primaryfactory": [
            "Hun Ho",
            "Panpour"
        ],
        "systemmanufacturer": {
            "chassis": "Mingh z33/9 Endo Steel",
            "engine": "VOX 280",
            "armor": "Maximillian 100 with CASE",
            "jumpjet": "Lexington Lifters",
            "communications": "Allet-C308",
            "targeting": "Allet T-11"
        }
    }
}