{
    "mtf2json": "0.2.3",
    "chassis": "Griffin",
    "model": "GRF-6S (Francine II)",
    "mul_id": 1308,
    "config": "Biped",
    "techbase": "Inner Sphere",
    "era": 3071,
    "source": "Starterbook: Wolf & Blake",
    "rules_level": 4,
    "rules_level_str": "Standard",
    "role": "Skirmisher",
    "quirks": [
        "battle_fists_la",
        "battle_fists_ra",
        "rugged_1",
        "ubiquitous_clan",
        "ubiquitous_is"
    ],
    "weapon_quirks": [
        {
            "quirk": "jettison_capable",
            "weapon": "ISSNPPC",
            "location": "right_arm",
            "slot": 4
        }
    ],
    "mass": 55,
    "engine": "275 Light Engine",
    "structure": {
        "type": "Endo Steel",
        "head": {
            "pips": 3
        },
        "center_torso": {
            "pips": 18
        },
        "left_torso": {
            "pips": 13
        },
        "right_torso": {
            "pips": 13
        },
        "left_arm": {
            "pips": 9
        },
        "right_arm": {
            "pips": 9
        },
        "left_leg": {
            "pips": 13
        },
        "right_leg": {
            "pips": 13
        }
    },
    "myomer": "Standard",
    "heat_sinks": {
        "quantity": 10,
        "type": "Double"
    },
    "walk_mp": 5,
    "run_mp": 8,
    "jump_mp": 5,
    "armor": {
        "type": "Reflective",
        "left_arm": {
            "pips": 18
        },
        "right_arm": {
            "pips": 18
        },
        "left_torso": {
            "front": {
                "pips": 20
            },
            "rear": {
                "pips": 6
            }
        },
        "right_torso": {
            "front": {
                "pips": 20
            },
            "rear": {
                "pips": 6
            }
        },
        "center_torso": {
            "front": {
                "pips": 27
            },
            "rear": {
                "pips": 8
            }
        },
        "head": {
            "pips": 9
        },
        "left_leg": {
            "pips": 26
        },
        "right_leg": {
            "pips": 26
        }
    },
    "weapons": [
        {
            "weapon": "ISSNPPC",
            "location": "right_arm",
            "facing": "front",
            "quantity": 1
        },
        {
            "weapon": "ISERMediumLaser",
            "location": "left_arm",
            "facing": "front",
            "quantity": 2
        },
        {
            "weapon": "ISLRM15",
            "location": "right_torso",
            "facing": "front",
            "quantity": 1,
            "ammo": 16
        },
        {
            "weapon": "ISERMediumLaser",
            "location": "center_torso",
            "facing": "front",
            "quantity": 1
        }
    ],
    "critical_slots": {
        "left_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "Lower Arm Actuator",
            "4": "Hand Actuator",
            "5": "ISERMediumLaser",
            "6": "ISERMediumLaser",
            "7": "Endo Steel",
            "8": "Endo Steel",
            "9": "Endo Steel",
            "10": "Endo Steel",
            "11": "Reflective Armor",
            "12": null
        },
        "right_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "Lower Arm Actuator",
            "4": "Hand Actuator",
            "5": "ISSNPPC",
            "6": "ISSNPPC",
            "7": "Endo Steel",
            "8": "Endo Steel",
            "9": "Endo Steel",
            "10": "Reflective Armor",
            "11": "Reflective Armor",
            "12": null
        },
        "left_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "Supercharger",
            "4": "Endo Steel",
            "5": "Endo Steel",
            "6": "Endo Steel",
            "7": "Reflective Armor",
            "8": "Reflective Armor",
            "9": "Reflective Armor",
            "10": "Reflective Armor",
            "11": "Reflective Armor",
            "12": "Reflective Armor"
        },
        "right_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "ISLRM15",
            "4": "ISLRM15",
            "5": "ISLRM15",
            "6": "ISLRM15 Ammo",
            "7": "ISLRM15 Ammo",
            "8": "ISCASE",
            "9": "Endo Steel",
            "10": "Endo Steel",
            "11": "Endo Steel",
            "12": "Reflective Armor"
        },
        "center_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "Fusion Engine",
            "4": "Gyro",
            "5": "Gyro",
            "6": "Gyro",
            "7": "Gyro",
            "8": "Fusion Engine",
            "9": "Fusion Engine",
            "10": "Fusion Engine",
            "11": "ISERMediumLaser",
            "12": "Jump Jet"
        },
        "head": {
            "1": "Life Support",
            "2": "Sensors",
            "3": "Cockpit",
            "4": "Endo Steel",
            "5": "Sensors",
            "6": "Life Support",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "left_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "Jump Jet",
            "6": "Jump Jet",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "right_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "Jump Jet",
            "6": "Jump Jet",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        }
    },
    "fluff": {
        "overview": "Built in 2492 the Griffin was originally classified as a heavy BattleMech, filling in the weight gap between mammoth machines like the Mackie and smaller recon 'Mechs like the Wasp, and intended for close assaults",
        "capabilities": "The massive and efficient fusion engine of the Griffin, giving it a cruising speed of 57.1 km/h, combined with five jump jets occupying the rear torso areas for a total jumping distance of 150 meters, is what distinguishes it from other medium 'Mechs and has kept the Griffin in the game over the centuries. Unfortunately, like most other early 'Mechs, the Griffin suffers from insufficient heat capacity with only twelve heat sinks installed. The result is that Griffin pilots, lacking the ability to do both, must choose at the outset of a fight whether to engage or withdraw. Nine and a half tons of armor plating compares quite favorably to many other medium 'Mechs, although as is often the case the Griffin will find itself in combat with larger 'Mechs. For this reason, two pairs of false armor baffles were added to the 'Mech, one on its shoulders providing limited protection to the LRM launcher and cockpit, and a smaller pair on the legs protecting the knees joints.",
        "deployment": "After becoming part of Stacy Church's new Black Widow Command Lance, Francine's Griffin was upgraded with experimental technologies. Dropping the Artemis IV and the rear facing small laser for a Supercharger to increase its speed, her 'Mech's armor was replaced with Laser Reflective plating, making it extremely resistant to the Word of Blake's new Variable-Speed Pulse Lasers.",
        "history": "Combining tremendous speed and firepower in one frame the Griffin briefly dominated in this role before being superseded by larger and better-equipped 'Mechs. However the Griffin was very popular among commanders and pilots alike and so Earthwerks Incorporated kept it in production, this time reclassified as a medium 'Mech and tasked with long-range fire support for medium lances. In this capacity the Griffin has excelled, combining good striking power, endurance and speed, with its only major weakness being a lack of close-range defensive weapons. During the Succession Wars the Griffin could be found in almost every unit of all the Great Houses, thanks in part to its diverse number of manufacturers. Besides being constructed from Earthwerks' factory on Keystone the Griffin was later acquired and built by Defiance Industries (Hesperus II), Kallon Industries (Talon), Brigadier Corporation (Oliver), and Norse BattleMech Works (later Victory Industries, Marduk). It was even manufactured in the Periphery by Vandenberg Mechanized Industries on Illiushin. Only the Capellan Confederation lacked a means of building the 'Mech, although they made up for it by purchasing a limited number from the Taurian Concordat. During the Fourth Succession War some of these manufacturers exchanged hands, with the Draconis Combine capturing Marduk from the Federated Suns and the Lyran Commonwealth taking Oliver from the Free Worlds League. This exchange also happened to coincide with several new variants being designed to exploit recently-recovered lostech. As such variants meant specifically for either Houses Kurita, Marik or the Federated Commonwealth found their way into the arsenals of all of them. During the Clan Invasion these manufacturers produced the new variants to meet the Clan threat while Vandenberg Industries continued to build original GRF-1N Griffins. When Vicore Industries began shopping around its \"Project Phoenix\" initiative, Defiance and Kallon Industries signed on to begin producing the completely redesigned GRF-6S Griffin. Victory Industries later signed up as well after the legal battle between Wolf's Dragoons and the Lyran Alliance saw the famous mercenary group selling its Light Fusion technology to both the Draconis Combine and Free Worlds League. The League designed a native update to the Griffin while ComStar had their own built as well which, ominously, soon began appearing in the ranks of the Word of Blake Militia. The Griffin would continue to remain a staple of the battlefields of the Inner Sphere during the maelstrom of the Jihad, the era of the Republic of the Sphere and the rise of the ilClan, with models still in production within the Free Worlds League and the Wolf Empire.",
        "manufacturer": [
            "Field Refit"
        ],
        "primaryfactory": [
            "Field Refit"
        ],
        "systemmanufacturer": {
            "chassis": "Earthwerks GRF Endo",
            "engine": "Defiance 275 Light Engine",
            "armor": "ArcShield Reflective",
            "jumpjet": "Chilton 950",
            "communications": "Neil 6000",
            "targeting": "RCA Instatrac Mk X"
        }
    }
}