{
    "chassis": "Hatchetman",
    "model": "HCT-3F",
    "mul_id": 1410,
    "config": "Biped",
    "techbase": "Inner Sphere",
    "era": 3023,
    "source": "TRO: 3039",
    "rules_level": 1,
    "rules_level_str": "Standard",
    "role": "Brawler",
    "quirks": [
        "anti_air"
    ],
    "weaponquirk": "fast_reload:RT:2:Autocannon/10",
    "mass": 45,
    "engine": "180 Fusion Engine(IS)",
    "structure": {
        "type": "Standard",
        "tech_base": "Inner Sphere",
        "head": {
            "pips": 3
        },
        "center_torso": {
            "pips": 14
        },
        "left_torso": {
            "pips": 11
        },
        "right_torso": {
            "pips": 11
        },
        "left_arm": {
            "pips": 7
        },
        "right_arm": {
            "pips": 7
        },
        "left_leg": {
            "pips": 11
        },
        "right_leg": {
            "pips": 11
        }
    },
    "myomer": "Standard",
    "ejection": "Full Head Ejection System",
    "heat_sinks": {
        "quantity": 11,
        "type": "Single"
    },
    "walk_mp": 4,
    "run_mp": 6,
    "jump_mp": 4,
    "armor": {
        "type": "Standard",
        "tech_base": "Inner Sphere",
        "left_arm": {
            "pips": 11
        },
        "right_arm": {
            "pips": 11
        },
        "left_torso": {
            "front": {
                "pips": 14
            },
            "rear": {
                "pips": 4
            }
        },
        "right_torso": {
            "front": {
                "pips": 14
            },
            "rear": {
                "pips": 4
            }
        },
        "center_torso": {
            "front": {
                "pips": 14
            },
            "rear": {
                "pips": 4
            }
        },
        "head": {
            "pips": 6
        },
        "left_leg": {
            "pips": 11
        },
        "right_leg": {
            "pips": 11
        }
    },
    "weapons": {
        "1": {
            "Medium Laser": {
                "location": "left_arm",
                "facing": "front",
                "quantity": 1
            }
        },
        "2": {
            "Medium Laser": {
                "location": "right_arm",
                "facing": "front",
                "quantity": 1
            }
        },
        "3": {
            "AC/10": {
                "location": "right_torso",
                "facing": "front",
                "quantity": 1
            }
        }
    },
    "critical_slots": {
        "left_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "Lower Arm Actuator",
            "4": "Hand Actuator",
            "5": "Medium Laser",
            "6": null,
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "right_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "Lower Arm Actuator",
            "4": "Hand Actuator",
            "5": "Hatchet",
            "6": "Hatchet",
            "7": "Hatchet",
            "8": "Medium Laser",
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "left_torso": {
            "1": "Heat Sink",
            "2": "Heat Sink",
            "3": null,
            "4": null,
            "5": null,
            "6": null,
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "right_torso": {
            "1": "Heat Sink",
            "2": "Heat Sink",
            "3": "Autocannon/10",
            "4": "Autocannon/10",
            "5": "Autocannon/10",
            "6": "Autocannon/10",
            "7": "Autocannon/10",
            "8": "Autocannon/10",
            "9": "Autocannon/10",
            "10": null,
            "11": null,
            "12": null
        },
        "center_torso": {
            "1": "Fusion Engine",
            "2": "Fusion Engine",
            "3": "Fusion Engine",
            "4": "Gyro",
            "5": "Gyro",
            "6": "Gyro",
            "7": "Gyro",
            "8": "Fusion Engine",
            "9": "Fusion Engine",
            "10": "Fusion Engine",
            "11": "IS Ammo AC/10",
            "12": "IS Ammo AC/10"
        },
        "head": {
            "1": "Life Support",
            "2": "Sensors",
            "3": "Cockpit",
            "4": null,
            "5": "Sensors",
            "6": "Life Support",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "left_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "Jump Jet",
            "6": "Jump Jet",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        },
        "right_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "Jump Jet",
            "6": "Jump Jet",
            "7": null,
            "8": null,
            "9": null,
            "10": null,
            "11": null,
            "12": null
        }
    },
    "fluff": {
        "overview": "Introduced in 3023 during the Succession Wars, the Hatchetman is a very distinctive BattleMech because, as its name suggests, it carries a 'Mech-sized Hatchet.",
        "capabilities": "As well as being the first design to carry one, the Hatchetman itself was the first totally new 'Mech produced in the Inner Sphere in over a century, and was also the first production 'Mech to use a Full-Head Ejection System. At its heart, the Hatchetman is an urban combat 'Mech. Once it has safely escorted friendly forces out of a city, the 'Mech assumes the role of guerrilla fighter, ambushing from hiding places to blast an enemy apart at point-blank ranges with its impressive weaponry or cleave them in two with its hatchet. Among the Hatchetman's various components, the Full-Head Ejection System remains the most unusual. Rather than the pilot ejecting from the 'Mech on their own, rocket motors mounted beneath the head force the entire assembly to disengage from the rest of the chassis. Total flight time is only thirty seconds, and although it can be manually controlled by the pilot most allow the battle computer to direct the flight path of the head; typically the computer will use the communications system to locate friendly forces and direct the head towards a safe landing spot. One of the few downsides of the system is that the 'Mech must be in some form of upright position in order for it to work.",
        "deployment": "Aside from its Hatchet, the 11-meter tall Hatchetman carries a Defiance Killer Autocannon/10 embedded within its right torso. As its primary ranged weapon the autocannon allows the 'Mech to be effective in both stand up fights in front line combat and in the concrete jungle of a city. It is supplied with two tons of ammunition located in the center torso, organized into two ten-round clips just like those used in the Enforcer. As secondary weapons, the Hatchetman carries two Defiance B3M Medium Lasers, one in each arm. Eleven heat sinks are enough to keep the 'Mech cool while firing its weapons. The weaponry is aimed by a versatile Ares-8 battle computer which is particularly adept at targeting Aerospace Fighters. Using data gathered through the armored sensor globe attached to the head, it is able to effectively advise the pilot where to aim in order to score a direct hit. Four jump jets split between the two legs gives the Hatchetman a jumping distance of 120 meters, allowing for impressive mobility in an urban environment and making up for its pedestrian top speed. Only six and a half tons of armor protect the 'Mech, and its thin legs are particularly susceptible to well-placed shots.",
        "history": "As well as being the first design to carry one, the Hatchetman itself was the first totally new 'Mech produced in the Inner Sphere in over a century, and was also the first production 'Mech to use a Full-Head Ejection System. Despite being first manufactured in the Lyran Commonwealth the Hatchetman was actually designed by the enigmatic Dr. B. Banzai of Team Banzai, a mercenary unit associated with the Federated Suns' New Avalon Institute of Science. Thus the 'Mech was also a signal of the growing cooperation between these newly-allied Successor States. In the design's first combat test, elements of the 4th Proserpina Hussars raided Sevren and were literally cut to pieces by a mostly Hatchetman-equipped battalion of the 26th Lyran Guards which lured the enemy into an industrial park. Where the Hatchetman is at a disadvantage is on open terrain, as its relatively slow speed, light armoring and general frailty leaves it vulnerable to other 'Mechs. Initially the Hatchetman's first production run was limited to garrisoning large Lyran cities, but its early successes inspired further deployments and the 'Mech soon began appearing in the arsenal of the Federated Suns, particularly among the Crucis Lancers and 1st Kathil Uhlans. In the wake of the Fourth Succession War and the formal creation of the Federated Commonwealth, the Hatchetman was selected to become one of the standard designs for the Armed Forces of the Federated Commonwealth. Demand for the 'Mech soon began to outstrip Defiance Industries' ability to supply it, even after tripling output from their Hesperus II factory, and so it contracted Johnston Industries to set up a Hatchetman line on Johnston. The recovery of lost Star League technology eventually allowed for the creation of the HCT-5S in 3049, with additional variants created in years hence. Among the other realms, the Draconis Combine managed to capture a few examples of the Hatchetman and successfully copy most of the design to produce their own following the War of 3039, however the 'Mech proved to be unpopular and the program was canceled. Hoping to salvage the project, Independence Weaponry experimented with the design and eventually created a variant more palatable to Kuritan pilots. Out in the Periphery, the introduction of the Hatchetman caused quite a stir within the Taurian Concordat when a group of mercenaries brought along their old HCT-3Fs upon integrating with the Taurian Defense Forces. Protector of the Realm Thomas Calderon ordered Taurus Territorial Industries to reverse-engineer the design, which they finally succeeded in accomplishing after much delay by 3054, only for production to be halted in 3066 when the Fighting Urukhai destroyed the Taurus Territorial Industries facility.",
        "manufacturer": [
            "Defiance Industries",
            "Taurus Territorial Industries"
        ],
        "primaryfactory": [
            "Hesperus II",
            "Taurus"
        ],
        "systemmanufacturer": {
            "chassis": "Chariot Type II",
            "engine": "GM 180",
            "armor": "Durallex Medium",
            "jumpjet": "Luxor 2/Q",
            "communications": "TharHes Thalia HM-22",
            "targeting": "TharHes Ares-8A"
        }
    }
}