{
    "mtf2json": "0.2.7",
    "chassis": "Thunderbolt",
    "model": "TDR-5Sb",
    "mul_id": 3239,
    "source": "Historical: Operation Klondike",
    "config": "Biped",
    "tech_base": "IS",
    "era": 2753,
    "rules_level": 2,
    "rules_level_str": "Standard",
    "role": "Brawler",
    "quirks": [
        "multi_trac",
        "rugged_2",
        "ubiquitous_is"
    ],
    "mass": 65,
    "engine": {
        "name": "260 Fusion Engine",
        "type": "Standard",
        "tech_base": "IS"
    },
    "structure": {
        "type": "Endo-Steel",
        "tech_base": "IS",
        "head": {
            "pips": 3
        },
        "center_torso": {
            "pips": 21
        },
        "left_torso": {
            "pips": 15
        },
        "right_torso": {
            "pips": 15
        },
        "left_arm": {
            "pips": 10
        },
        "right_arm": {
            "pips": 10
        },
        "left_leg": {
            "pips": 15
        },
        "right_leg": {
            "pips": 15
        }
    },
    "myomer": "Standard",
    "heat_sinks": {
        "quantity": 14,
        "type": "Double"
    },
    "walk_mp": 4,
    "run_mp": 6,
    "jump_mp": 0,
    "armor": {
        "type": "Standard",
        "tech_base": "IS",
        "left_arm": {
            "pips": 20
        },
        "right_arm": {
            "pips": 20
        },
        "left_torso": {
            "front": {
                "pips": 24
            },
            "rear": {
                "pips": 6
            }
        },
        "right_torso": {
            "front": {
                "pips": 24
            },
            "rear": {
                "pips": 6
            }
        },
        "center_torso": {
            "front": {
                "pips": 30
            },
            "rear": {
                "pips": 11
            }
        },
        "head": {
            "pips": 9
        },
        "left_leg": {
            "pips": 29
        },
        "right_leg": {
            "pips": 29
        }
    },
    "weapons": [
        {
            "name": "ISMediumLaser",
            "location": "left_torso",
            "facing": "front",
            "quantity": 3
        },
        {
            "name": "ISLRM15",
            "location": "right_torso",
            "facing": "front",
            "quantity": 1,
            "ammo": 16
        },
        {
            "name": "ISERPPC",
            "location": "right_arm",
            "facing": "front",
            "quantity": 1
        },
        {
            "name": "ISStreakSRM2",
            "location": "right_torso",
            "facing": "front",
            "quantity": 1,
            "ammo": 50
        },
        {
            "name": "ISSmallPulseLaser",
            "location": "left_arm",
            "facing": "front",
            "quantity": 2
        }
    ],
    "critical_slots": {
        "left_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "Lower Arm Actuator",
            "4": "Hand Actuator",
            "5": "ISSmallPulseLaser",
            "6": "ISSmallPulseLaser",
            "7": "Endo-Steel",
            "8": "Endo-Steel",
            "9": "Endo-Steel",
            "10": "Endo-Steel",
            "11": null,
            "12": null
        },
        "right_arm": {
            "1": "Shoulder",
            "2": "Upper Arm Actuator",
            "3": "Lower Arm Actuator",
            "4": "Hand Actuator",
            "5": "ISDouble Heat Sink",
            "6": "ISDouble Heat Sink",
            "7": "ISDouble Heat Sink",
            "8": "ISERPPC",
            "9": "ISERPPC",
            "10": "ISERPPC",
            "11": "Endo-Steel",
            "12": "Endo-Steel"
        },
        "left_torso": {
            "1": "ISDouble Heat Sink",
            "2": "ISDouble Heat Sink",
            "3": "ISDouble Heat Sink",
            "4": "ISDouble Heat Sink",
            "5": "ISDouble Heat Sink",
            "6": "ISDouble Heat Sink",
            "7": "ISMediumLaser",
            "8": "ISMediumLaser",
            "9": "ISMediumLaser",
            "10": "Endo-Steel",
            "11": "Endo-Steel",
            "12": null
        },
        "right_torso": {
            "1": "ISDouble Heat Sink",
            "2": "ISDouble Heat Sink",
            "3": "ISDouble Heat Sink",
            "4": "ISLRM15",
            "5": "ISLRM15",
            "6": "ISLRM15",
            "7": "ISArtemisIV",
            "8": "ISStreakSRM2",
            "9": "ISStreakSRM2 Ammo",
            "10": "ISLRM15 Ammo Artemis-capable",
            "11": "ISLRM15 Ammo Artemis-capable",
            "12": "ISCASE"
        },
        "center_torso": {
            "1": "Engine",
            "2": "Engine",
            "3": "Engine",
            "4": "Gyro",
            "5": "Gyro",
            "6": "Gyro",
            "7": "Gyro",
            "8": "Engine",
            "9": "Engine",
            "10": "Engine",
            "11": "Endo-Steel",
            "12": "Endo-Steel"
        },
        "head": {
            "1": "Life Support",
            "2": "Sensors",
            "3": "Cockpit",
            "4": null,
            "5": "Sensors",
            "6": "Life Support"
        },
        "left_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "Endo-Steel",
            "6": "Endo-Steel"
        },
        "right_leg": {
            "1": "Hip",
            "2": "Upper Leg Actuator",
            "3": "Lower Leg Actuator",
            "4": "Foot Actuator",
            "5": "Endo-Steel",
            "6": "Endo-Steel"
        }
    },
    "fluff": {
        "overview": "The Thunderbolt commonly known as the T-Bolt, is a venerable BattleMech with a lineage dating back to 2491. As one of the pioneering designs for planetary assault, it is distinguished by its robust firepower and has become a staple across the Successor States. Despite being eclipsed by newer, larger 'Mechs, the Thunderbolt's exceptional design and formidable reputation have ensured its continuous production and operational use.",
        "capabilities": "The Thunderbolt, with its inception dating back to 2491, has firmly established itself as a paragon of battlefield endurance and versatility. Renowned for its multi-faceted armament, the 'Mech is equipped with a robust array of weaponry tailored for engagements at various ranges. Its arsenal, typically comprising a balanced mix of energy weapons and missile launchers, enables the Thunderbolt to deliver substantial firepower in combat scenarios ranging from long-distance bombardment to close-quarters engagements.Armor-wise, the Thunderbolt stands out for its exceptional resilience. Its thick plating, often surpassing that of 'Mechs well above its weight class, ensures it can endure severe punishment on the front lines. This durability, combined with its moderate speed, makes the Thunderbolt a formidable opponent capable of holding its ground under heavy fire.However, the Thunderbolt's impressive offensive capability comes with the challenge of heat management. Pilots must skillfully balance the 'Mech's weapon output to prevent overheating, which could lead to shutdowns or ammunition explosions. Tactical deployment near natural cooling sources has become a standard practice to mitigate this risk, allowing the Thunderbolt to sustain its barrage of firepower effectively.Throughout its service history, the Thunderbolt has undergone numerous iterations and upgrades, reflecting the changing dynamics of warfare. Modern variants have seen enhancements like CASE II technology integration, which secures its ammunition storage, and the introduction of advanced sensor and communication systems to improve battlefield coordination.From the original TDR-5S to the advanced TDR-10M and TDR-12R models, the Thunderbolt's evolution continues to be driven by the need for a 'Mech that balances offensive power, defensive capability, and strategic flexibility. Its enduring presence in the arsenals of Inner Sphere and Periphery forces underscores the Thunderbolt's iconic status and persistent efficacy in combat operations.",
        "deployment": "The TDR-5Sb, introduced in 2753, is a Star League Defense Force Royal variant that integrates advanced Star League technology into the Thunderbolt chassis. Utilizing an Endo Steel structure, it upgrades the firepower with an ER PPC and Streak SRM-2 launcher, complemented by Artemis IV FCS for the LRM system. Enhanced with double heat sinks and CASE for ammunition safety, the 5Sb variant represents a significant technological leap, optimizing the Thunderbolt for greater battlefield efficiency and versatility.",
        "history": "The Thunderbolt, a BattleMech with a service record spanning over seven centuries, has been a mainstay in the arsenals of Inner Sphere and Periphery forces. Since its introduction in 2491, the Thunderbolt has seen extensive use in various military campaigns, with Houses Steiner and Marik as its primary operators. These mercantile states have also facilitated its distribution, making it a common fixture in many other military forces.The Fourth Succession War and the Andurien War significantly impacted the distribution and deployment of the Thunderbolt, particularly affecting House Liao's previously substantial numbers. However, the Taurian Concordat, hosting two Thunderbolt manufacturing facilities, has leveraged this 'Mech as the backbone of its military might.Notably, during 3083 in Operation Golden Fortress, Capellan forces utilized Thunderbolts extensively in the defense of Tikonov, demonstrating their strategic value in urban warfare by employing LRM minefields to ensnare Republic combat vehicles, showcasing the 'Mech's adaptability to various combat situations.In 3145, the Earthwerks Thunderbolts, specifically the TDR-12R models, played pivotal roles in the defense of Kogan Gate. Their indirect fire capabilities and subsequent melee engagements highlighted the Thunderbolt's enduring presence on the battlefield and its ability to adapt to evolving warfare dynamics.Historical engagements like the battle of Chesterton in 2828 and the bizarre \"La Guerra de Queso\" on Illiushin in 2847 underline the Thunderbolt's versatile service record. In Chesterton, the Thunderbolt's durability was tested in harsh chemical warfare conditions, while on Illiushin, the 'Mech's involvement in a pirate raid gone comically awry shows its ubiquitous presence across the galaxy, even in less conventional military operations.",
        "manufacturer": [
            "Vandenberg Mechanized Industries",
            "Earthwerks Incorporated",
            "Earthwerks Ltd."
        ],
        "primaryfactory": [
            "Pinard",
            "Terra",
            "Tikonov"
        ],
        "systemmanufacturer": {
            "chassis": "Earthwerks TDR",
            "engine": "Magna 260",
            "armor": "Ryerson 150",
            "communications": "Neil 8000",
            "targeting": "RCA Instatrac Mark X"
        }
    }
}